/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   newZombie.cpp                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: sna <sna@student.42seoul.kr>               +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/03/27 01:08:28 by sna               #+#    #+#             */
/*   Updated: 2022/03/27 01:11:02 by sna              ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "Zombie.hpp"

/*
** new 키워드를 통해 인스턴스를 힙 영역에 생성(동적할당)
** 나중에 delete 키워드를 호출해야 소멸자가 호출되고 메모리 해제가됨
*/
Zombie* newZombie(std::string name)
{
	Zombie *new_zombie;

	new_zombie = new Zombie(name);
	return (new_zombie);
}